var data = [];
var dataStr = '1、碟中谍6全面瓦解<br>\
<br>\
·有时好意会造成恶果，人反而被自己所造成的结果所困扰。<br>\
·伊桑·亨特（汤姆·克鲁斯）和他的团队（亚历克·鲍德温、西蒙·佩吉、文·瑞姆斯）将在《碟中谍6》中再度回归<br>\
·他们会与观众们熟悉的盟友（丽贝卡·弗格森、米歇尔·莫娜汉）一起与时间赛跑<br>\
·对不起是你的解脱，不代表我要原谅你的过错。<br>\
·应对一次任务中出现的意外。<br>\
<br>\
<br>\
2、蚁人2：黄蜂女现身<br>\
<br>\
·继《美国队长3》的故事线之后<br>\
·斯科特·朗迎来了自己作为超级英雄和孩子父亲的双重身份<br>\
·一方面，他在背负着蚁人职责的同时努力过好自己的生活<br>\
·另一方面，二代黄蜂女霍普·凡·戴恩和汉克·皮姆博士又向他传达了一项紧迫的新任务<br>\
·斯科特必须再次穿上战衣<br>\
·与黄蜂女并肩作战，共同破解来自过去的谜题<br>\
<br>\
<br>\
3、阿尔法：狼伴归途<br>\
<br>\
·故事发生于两万年前的欧洲北部，地球正处于弱肉强食的冰川时期<br>\
·心地善良的男主角科达是部落首领的儿子<br>\
·在一次部落集体狩猎中，科达不慎跌落悬崖，众人以为科达已死<br>\
·但大难不死的科达被洪水卷走幸存下来，只身流落荒野<br>\
·途中科达与一匹野狼相遇，给它起名阿尔法，意即狼群首领。<br>\
·人与狼之间第一次建立了友谊。随后的种种奇遇，甚至改变了人类和世界的未来。<br>\
<br>\
<br>\
4、道高一丈<br>\
<br>\
·宋朝、刘海洋、黄天成是警校同窗，宋朝因犯错被开除，警察梦破灭。<br>\
·刘海洋、黄天成顺利毕业成为了真正的警察。 <br>\
·被警校开除的宋朝受刘海洋之父刘守义之托，混进贯宇集团调查一桩纵火案。<br>\
·光明与黑暗，正义与邪恶，扑朔迷离，环环相扣，<br>\
·最终“魔高一尺、道高一丈”。 <br>\
<br>\
<br>\
5、传奇的诞生<br>\
<br>\
·球王贝利儿时从贫民窟擦鞋童，靠自己的努力克服重重阻碍，逆转绝境成为足球世界最强者<br>\
·影片揭秘了贝利成名前不为人知的经历<br>\
·家境贫穷、旁人的冷眼、队友的排挤并没有阻碍贝利的成长<br>\
·父母的教育一直影响着贝利<br>\
·从被人贬低到万人瞩目，他一个人的逆袭，燃动了数十亿人的斗志<br>\
<br>\
<br>\
6、李宗伟：败者为王<br>\
<br>\
·电影改编自羽坛天王李宗伟的真实经历<br>\
·李宗伟从小就喜欢羽毛球，但是贫困的家境和父亲的反对，让打球的梦想成为一种奢望<br>\
·但他的毅力也终于打动了父亲，开始了正规的羽球训练，并被选入国家队<br>\
·然而幸运的日子没有多久，打击接踵而来，队友排挤、落选、失恋，他更是在国际大赛中遇到劲敌，频频落败。<br>\
·背负着重重压力的李宗伟面对强大对手，选择了再次出发<br>\
<br>\
<br>\
7、精灵旅社3：疯狂假期<br>\
<br>\
·德古拉和家人朋友们踏上了一艘邮轮<br>\
·宿命之敌“吸血鬼猎人”范海辛正在船上布置天罗地网等待“猎物”上门<br>\
·除了爆笑搞怪，这次的冒险更加惊险刺激而纠结<br>\
·因为在茫茫大海中，德古拉除了要面对重重家庭阻力、拯救朋友们的压力<br>\
·也许还有......一个美女? <br>\
<br>\
<br>\
8、快把我哥带走<br>\
<br>\
·拥有一个每天耍贱整蛊妹妹、毫无家庭感的哥哥是一种什么感受？<br>\
·时秒只希望哥哥时分彻底消失！连珍贵的生日愿望都是“快把我哥带走”。<br>\
·不料愿望成真，哥哥变成闺蜜妙妙的哥哥，时秒同情妙妙的同时心里暗爽摆脱“大魔王”！<br>\
·变成独生女的时秒感觉生活无限美好，但却发现<br>\
·时分除了整天和好基友甄开心、万岁插科打诨、整蛊妹妹妙妙之外<br>\
·还隐藏着不为人知的秘密<br>\
<br>\
<br>\
9、苏丹<br>\
<br>\
·来自印度北方小镇的苏丹遇见了摔角教练的女儿<br>\
·苏丹为了心仪女孩，不仅开始学起摔角，在短时间内就获得地方冠军，展现了他的决心和天分<br>\
·他不但娶得美人归，还和妻子一起代表印度参加奥运<br>\
·但就在苏丹获得奥运金牌的同时，他却因为骄傲自大而失去了挚爱的家庭<br>\
·唯一能赢回妻子芳心的办法，就是站回属于他的舞台<br>\
<br>\
<br>\
10、一出好戏<br>\
<br>\
·马进欠下债务，与远房表弟小兴在底层社会摸爬滚打<br>\
·习惯性的买彩票，企图一夜暴富，并迎娶自己的同事姗姗<br>\
·一日，公司全体员工出海团建，途中，马进收到了彩票中头奖的信息，六千万！ <br>\
·就在马进狂喜自己翻身的日子终于到来之际，一场突如其来的滔天巨浪打破了一切<br>\
·苏醒过来的众人发现身处荒岛 ，丧失了一切与外界的联系<br>\
<br>\
<br>\
11、西虹市首富<br>\
<br>\
·西虹市丙级球队大翔队的守门员王多鱼因比赛失利被教练开除<br>\
·一筹莫展之际王多鱼突然收到神秘人士金老板的邀请，被告知自己竟然是保险大亨王老太爷的唯一继承人!<br>\
·但是王老太爷给出了一个非常奇葩的条件，那就是要求王多鱼在一个月内花光十亿，还不能告诉身边人，否则失去继承权<br>\
·王多鱼毫不犹豫签下了“军令状”，与好友庄强以及财务夏竹一起开启了“挥金之旅”<br>\
<br>\
<br>\
12、信仰者<br>\
<br>\
·方志敏率领红十军团直插国民党腹地<br>\
·谭家桥一战，由于军团长刘畴西刚愎自用，战况急转直下，方志敏等将领在怀玉山先后被俘<br>\
·在狱中，方志敏等人和敌人坚决斗争<br>\
·刘畴西更是对所犯错误悔恨不已，造成红十军团全军覆没,劝降无济于事，蒋介石下令枪毙方志敏<br>\
·你们只能砍下我的头，绝不会动摇我的信仰。信仰者们被带上刑场<br>\
<br>\
<br>\
13、大师兄<br>\
<br>\
·陈侠，一位初出茅庐的教师，他的学生全是品学皆劣的边缘青年<br>\
·陈侠运用非常教学的手法，从家访、投其所好、甚至修补各人的家庭关系，化解每位学生的问题。<br>\
·最终把全班学生收服!一切向好之际，陈侠遇到黑道人物鹰哥<br>\
·为了学生，陈侠跟鹰哥展开一场守护学生前途的终极大战! <br>\
<br>\
<br>\
14、新乌龙院之笑闹江湖<br>\
<br>\
·取材自敖幼祥的经典漫画IP《乌龙院》<br>\
·讲述了乌龙院又到新一年招生季，一心想要当坏人的阿威和想要“学坏”的程明星潜入到乌龙院，想要偷师学艺并肩负秘密使命<br>\
·二人为了骗取了长眉师父的信任，与小文师兄、大师兄、阳光、“蛇蝎美人小师姐”蕊蕊等一众徒弟在乌龙院内发生了一系列啼笑皆非的乌龙囧事<br>\
·随着神秘女子的出现，斗智斗勇的荒唐囧事也即将发生<br>\
<br>\
<br>\
15、吻隐者<br>\
<br>\
·高原雪山脚下<br>\
·小提琴手文峰（李至正饰）与神秘女子朵拉（谭卓饰）之间一个浪漫的邂逅之吻<br>\
·竟让文峰成为了万中无一的吻瘾者<br>\
·他的生活自此因对吻的迫切渴求而陷入困境，只得再次踏上高原探寻答案<br>\
·一个时空交错的凄美爱情故事就此拉开帷幕<br>\
<br>\
<br>\
16、藏北秘岭-重返无人区<br>\
<br>\
·每个人都有自己心底的无人区<br>\
·都有一些难以启齿又无法解决的伤痛<br>\
·无论是否执着于无人区和山野<br>\
·每个人都应该给自己一个机会<br>\
·一个与自己和解、与过往和解、与他人和解的机会。<br>\
';
var d = dataStr.split('<br><br><br>');
for (var i = 0; i < d.length; i++) {
    var c = d[i].split('<br><br>');
    data.push({
        img: c[0].replace('、',' ') + '.jpg',
        caption: c[0].split('、')[1],
        desc: c[1]
    });
    console.log(c[0].replace('、', ' ') + '.jpg');
}